Revit 2017 API
StructuralSectionRound.TorsionalModulus Property
 Section modulus for calculations of torsion stresses (Ct)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public double TorsionalModulus { get; set; }
Visual Basic
Public Property TorsionalModulus As Double
	Get
	Set
Visual C++
public:
property double TorsionalModulus {
	double get ();
	void set (double value);
}
See Also
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace